In [ ]:
# Mongodb_connection string 
# password: GXZTUcvFO8TzCBW7
# username: tinuagrawal1097


# mongodb+srv://tinuagrawal1097:GXZTUcvFO8TzCBW7@cluster0.cyjzqja.mongodb.net/?retryWrites=true&w=majority&appName=Cluster0

SyntaxError: invalid syntax (2322910136.py, line 3)

In [3]:
import pandas as pd

In [6]:
import os
os.getcwd()

'e:\\MLOPS_PROJECTS\\US_VISA_APPROVAL_PREDITCTION\\US_Visa_Approval_Prediction\\Notebook'

In [7]:
us_data = pd.read_csv('Visadataset.csv')

In [8]:
us_data.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified